homeworks/hw05/23127234 - Nguyen An Nghiep/test-plan-human-corrected/reports/endurance_html/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 12817,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 17.441757041429366,
    "medianResTime" : 14.0,
    "minResTime" : 2.0,
    "maxResTime" : 657.0,
    "pct1ResTime" : 31.0,
    "pct2ResTime" : 42.0,
    "pct3ResTime" : 103.0,
    "throughput" : 14.245907233212959,
    "receivedKBytesPerSec" : 1558.6251114698198,
    "sentKBytesPerSec" : 5.091757627845819
  },
  "02_Get_Products" : {
    "transaction" : "02_Get_Products",
    "sampleCount" : 4271,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 23.285179114961313,
    "medianResTime" : 21.0,
    "minResTime" : 2.0,
    "maxResTime" : 396.0,
    "pct1ResTime" : 40.0,
    "pct2ResTime" : 49.0,
    "pct3ResTime" : 85.27999999999975,
    "throughput" : 4.766650632744692,
    "receivedKBytesPerSec" : 1560.6184079358286,
    "sentKBytesPerSec" : 1.4383740678887789
  },
  "03_Create_Product" : {
    "transaction" : "03_Create_Product",
    "sampleCount" : 4263,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 21.32864180154824,
    "medianResTime" : 16.0,
    "minResTime" : 12.0,
    "maxResTime" : 657.0,
    "pct1ResTime" : 28.0,
    "pct2ResTime" : 40.0,
    "pct3ResTime" : 149.35999999999967,
    "throughput" : 4.76076672578073,
    "receivedKBytesPerSec" : 1.4214600696693485,
    "sentKBytesPerSec" : 2.4668584453634175
  },
  "01_Login_Admin" : {
    "transaction" : "01_Login_Admin",
    "sampleCount" : 4283,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7.745972449217846,
    "medianResTime" : 3.0,
    "minResTime" : 2.0,
    "maxResTime" : 573.0,
    "pct1ResTime" : 16.0,
    "pct2ResTime" : 27.0,
    "pct3ResTime" : 72.0,
    "throughput" : 4.760491587723422,
    "receivedKBytesPerSec" : 2.975307242327139,
    "sentKBytesPerSec" : 1.204069649629264
  }
}