homeworks/hw05/23127234 - Nguyen An Nghiep/test-plan-human-corrected/reports/load_html/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 4956,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8.206214689265495,
    "medianResTime" : 6.0,
    "minResTime" : 1.0,
    "maxResTime" : 461.0,
    "pct1ResTime" : 13.0,
    "pct2ResTime" : 14.0,
    "pct3ResTime" : 26.43000000000029,
    "throughput" : 13.772328623989862,
    "receivedKBytesPerSec" : 580.259992302391,
    "sentKBytesPerSec" : 4.918781063117615
  },
  "02_Get_Products" : {
    "transaction" : "02_Get_Products",
    "sampleCount" : 1648,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6.208131067961156,
    "medianResTime" : 5.0,
    "minResTime" : 1.0,
    "maxResTime" : 327.0,
    "pct1ResTime" : 8.0,
    "pct2ResTime" : 10.0,
    "pct3ResTime" : 22.529999999999973,
    "throughput" : 4.629343520885418,
    "receivedKBytesPerSec" : 582.2565569784264,
    "sentKBytesPerSec" : 1.3969405741734318
  },
  "03_Create_Product" : {
    "transaction" : "03_Create_Product",
    "sampleCount" : 1644,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 14.532238442822367,
    "medianResTime" : 12.0,
    "minResTime" : 10.0,
    "maxResTime" : 461.0,
    "pct1ResTime" : 14.0,
    "pct2ResTime" : 16.0,
    "pct3ResTime" : 97.19999999999982,
    "throughput" : 4.653558953571975,
    "receivedKBytesPerSec" : 1.3875956930519306,
    "sentKBytesPerSec" : 2.411305906750491
  },
  "01_Login_Admin" : {
    "transaction" : "01_Login_Admin",
    "sampleCount" : 1664,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.9350961538461466,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 309.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 10.0,
    "pct3ResTime" : 18.699999999999818,
    "throughput" : 4.625845801433345,
    "receivedKBytesPerSec" : 2.8911536258958406,
    "sentKBytesPerSec" : 1.1700137329797229
  }
}