homeworks/hw05/23127234 - Nguyen An Nghiep/test-plan-human-corrected/reports/spike_html/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 14261,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 110.21365963116209,
    "medianResTime" : 33.0,
    "minResTime" : 1.0,
    "maxResTime" : 2168.0,
    "pct1ResTime" : 305.0,
    "pct2ResTime" : 446.0,
    "pct3ResTime" : 1346.0,
    "throughput" : 47.63352149370387,
    "receivedKBytesPerSec" : 5645.715412354079,
    "sentKBytesPerSec" : 16.966911496083704
  },
  "02_Get_Products" : {
    "transaction" : "02_Get_Products",
    "sampleCount" : 4755,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 124.36340694006319,
    "medianResTime" : 34.0,
    "minResTime" : 1.0,
    "maxResTime" : 2168.0,
    "pct1ResTime" : 334.0,
    "pct2ResTime" : 466.39999999999964,
    "pct3ResTime" : 1511.3199999999988,
    "throughput" : 16.03580148655758,
    "receivedKBytesPerSec" : 5685.394975011508,
    "sentKBytesPerSec" : 4.838928378267863
  },
  "03_Create_Product" : {
    "transaction" : "03_Create_Product",
    "sampleCount" : 4677,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 112.81248663673308,
    "medianResTime" : 35.0,
    "minResTime" : 10.0,
    "maxResTime" : 2161.0,
    "pct1ResTime" : 308.0,
    "pct2ResTime" : 445.0,
    "pct3ResTime" : 1287.3000000000038,
    "throughput" : 15.884444655769107,
    "receivedKBytesPerSec" : 4.7430969891047035,
    "sentKBytesPerSec" : 8.230797460382286
  },
  "01_Login_Admin" : {
    "transaction" : "01_Login_Admin",
    "sampleCount" : 4829,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 93.76371919652121,
    "medianResTime" : 29.0,
    "minResTime" : 1.0,
    "maxResTime" : 1905.0,
    "pct1ResTime" : 259.0,
    "pct2ResTime" : 415.0,
    "pct3ResTime" : 695.6999999999998,
    "throughput" : 16.129463241925247,
    "receivedKBytesPerSec" : 10.08091452620328,
    "sentKBytesPerSec" : 4.07962009732289
  }
}